{
	"name": "Abandoned Home",
	"long_desc": "The door creaks as the Boy walks into the home, almost surprised to find that it looks rather ordinary, if not dusty and poorly kept.  He wonders how long it has been since someone has lived here.  He can make out small footprints, likely from neighborhood kids coming in and out as they play.  The Boy looks around, as if searching for clues to why the owner hasn’t returned.  As he intrudes on the home, something catches his eye: a drawer with a lock on it. The Boy fiddles with it, but it is secured tight. \n\nOn a table nearby sits a few items, such as a shirt.  There is an <old journal>, and another rectangular object that looks like an electronic, almost like an <old phone>.  Aside from that, there is not much of note in the house, and certainly nothing that seems to identify the old owner.  \n",
	"short_desc": "The abandoned home in Astraia looks even dustier than the last time the Boy saw it.  It’s fair to assume that its owner still hasn't returned.  The journal and phone still sit on the desk, just as they did before.  Sunlight faintly peeks through the windows.",
	"prior_visit": "false",
	"connections": ["Astraia - Residence Area", null, null, null],
	"items": ["Dull Pendant"],
	"features":
	[
		{
			"name": "old journal",
			"desc": "A worn-down diary of sorts sits on a table. It must be years old, as the binding is barely holding together and the writings have mostly faded. Strangely, some of the fading letters look like English, but it's hard to say for certain.",
			"is_interactive": "false",
			"interactions": null
		},
		{
			"name": "old phone",
			"desc": "Next to the journal is a small, rectangular object. Looking closer, the Boy realizes that it might be a phone model from years ago, as he remembers seeing something similar in a box in their family's attic.  Flipping the cover reveals a tiny screen and the familiar number keys, but nothing seems to work.\n\nThe lack of technology in the town makes it clear that the object is foreign to this area, and it's likely someone from his world has been here long ago. ",
			"is_interactive": "false",
			"interactions": null
		}
	]
}
