{
	"name": "Serene Forest - South",
	"long_desc": "The Boy groans and stretches as he wakes up. As he rolls to the side, he feels an unfamiliar texture on his face. Slowly opening his eyes, he sees verdant green and  glimpses of sunlight from above.  He sits up with widening eyes as he realizes he is laying in grass, surrounded by trees, instead of his bedroom.\n\nLooking around, all he can find is nature.  Thick tree trunks, tall bushes, scattered flowers, tree branches, the sounds of chirping and clicking - it seemed like a forest, but the Boy is unsure which forest.\n\nHe nervously tries to process where he is, and why he is here. He notices what seems to be a pathway towards the north, as a moderately-sized rabbit skitters by. The Boy is shocked by it, as the rabbit is a bright purple - far from an ordinary fur color. It’s at this moment that he realizes that if this is not a dream, he might well be in some different world.\n",
	"short_desc": "The forest is quiet and peaceful, full of immense vegetation - this is where the Boy had previously woken up.  A rabbit sits near a tree, grooming itself. Though the Boy could probably push through some shrubbery, the only clear opening is to the north, leading to another section of the forest.",
	"prior_visit": "false",
	"connections": ["Serene Forest - North", null, null, null],
	"items": ["Tree Branch"],
	"features": 
	[
		{
			"name": "tree",
			"desc": "A tall tree.  The Boy isn't very interested on plants or trees, so he has no idea what kind it is, or if it's even a tree that exists near his hometown. All he knows is that this tree is pretty tall, and has a large trunk. ",
			"is_interactive": "false",
			"interactions": null
		},
		{
			"name": "rabbit",
			"desc": "A rather large, purple rabbit. It seems to be slowly chewing on some leaves from a bush. The Boy has to close his eyes and pinch himself every time he looks at the rabbit because of how bizarre its fur color is.",
			"is_interactive": "false",
			"interactions": null
		}
	]
}
