{
    "name": "ls",
    "location": "Janitor's Closet",
    "inventory": [
        "key",
        "wallet"
    ],
    "rooms": "[{\"name\": \"Base Camp\", \"longDesc\": \"As Derek walks through the enchanted forest, he comes across a clearing set between the trees.   A dilapidated tent rests near a rocky moss covered outcropping. It appears that somebody had used this place as a base camp and left a tent behind. The tent is still standing but the rear right corner is leaning in where a tent spike has pulled out. The front tent flaps dance with the gentle breeze. The tent has seen better days. Near the tent, is a small entrance to a cave.\", \"shortDesc\": \"There is an abandoned tent and a small cave entrance.\", \"priorVisit\": false}, {\"name\": \"Throne Room\", \"longDesc\": \"A large room with a central throne, a King in royal arraignment sits. Guards line the walls on both sides. There are six doors, three to a side. Guards with crossed halberds guard each door.\", \"shortDesc\": \"A large room with a King and his guards. There are six doors that are being guarded.\", \"priorVisit\": false}, {\"name\": \"The Anteroom\", \"longDesc\": \"The Anteroom is a simple room, much like a lounge with a small couch and table. The door hangs ajar, there is a picture of forest trees along a white river on the front of the door. On the table is a box with a silver bow. Quintix sits on the couch, reading the paper.\", \"shortDesc\": \"There is a small couch and table. A picture is on one wall. The table has a box with a silver bow.\", \"priorVisit\": false}, {\"name\": \"The Road of Terror\", \"longDesc\": \"The road slowly darkens as the tree canopy thickens. Trash and the occasional bone litter the road. To the left is a dilapidated hut, the chimney is smoking. To the right is a small bridge that crosses a fast moving creek. The hut has a partially open window on the east side and a door on the south side.\", \"shortDesc\": \"The road is heavily littered. There is a dilapidated hut to the left and a small bridge to the right.\", \"priorVisit\": false}, {\"name\": \"The Cross Roads\", \"longDesc\": \"The Cross Roads is a place that you can find anything you desire. Hundreds of shops are scattered about a central circle. To the rear of the clearing, narrow roads lead off into multiple directions. At the entrance to the center there is a merchant and his stand filled with baubles. The Merchant is looking at Derek and gestures for him to come nearer. Behind all the stands, multiple roads lead off into different directions. Each road entrance has a sign next to it.\", \"shortDesc\": \"Hundreds of shops are in a clearing. Behind all the stands, multiple roads lead off into different directions. Each road entrance has a sign next to it.\", \"priorVisit\": false}, {\"name\": \"Hall of Mirrors\", \"longDesc\": \"The Hall of Mirrors is a dark building with  many gables and gargoyles along the roof edges. Vines flow down the walls. On the West side lies an entrance. The South side has a cellar door. Windows are along the East and North sides of the building.\", \"shortDesc\": \"The Hall of Mirrors is vine-covered. There is an entrance on the west side, a cellar door on the South side, windows on East and North sides.\", \"priorVisit\": false}, {\"name\": \"The Healing Oracle\", \"longDesc\": \"A large stone building with ornate carved decorations stands tall.  At the top of the stairs are rows of columns with carvings in each one.  Above the columns, the words \\u201cHealing Oracle\\u201d are carved into the stone. There is an entrance at the top of the steps, blocked by an iron portcullis. Pathways of cut stone pavers encircle the building to the right.\", \"shortDesc\": \"A large stone building with \\u201cHealing Oracle\\u201d carved into the stone. The entrance is blocked by an iron portcullis. A pathway encircles the building to the right.\", \"priorVisit\": false}, {\"name\": \"Ice Cavern\", \"longDesc\": \"Ice covers every surface. In an alcove cut into the west wall there is a small shelf, on the shelf there is a blue glass bottle. Below, stacked on the floor, are several large ice blocks. To the east, a cold river runs North - South. Large ice blocks, just like the ones stacked under the alcove, occasionally flow downstream.\", \"shortDesc\": \"There is a small shelf with a blue bottle, on the wall are several large ice blocks. To the east is a river.\", \"priorVisit\": false}, {\"name\": \"Enchanted Forest\", \"longDesc\": \"Large trees with hanging moss as far as the eye can see dominate the landscape, after a recent rain, petrichor fills his nose. He looks around and notices branches that have fallen are scattered about. To his left, a trail heads deeper into the forest. There are large boulders next to the river. There is movement between the boulders.\", \"shortDesc\": \"There are branches on the ground and large boulders next to the river. To the left, a trail heads deeper into the forest.\", \"priorVisit\": false}, {\"name\": \"The Misty River\", \"longDesc\": \"The Misty River has water as white as milk and the bottom cannot be seen. The river stretches roughly East/West but because the river moves so slowly, you cannot tell which direction it flows. Leaves are scattered around the edge of the river bank. An iron gate and fence block the path leading to the river.\", \"shortDesc\": \"The white as milk Misty River stretches east/west. Leaves are scattered around the back, an iron fence and gate block the path leading to the river.\", \"priorVisit\": false}, {\"name\": \"The Armory\", \"longDesc\": \"The room is like an armor museum. Hundreds of armor suits in stands behind glass enclosures fill the room. Most of the displays are on large pedestals, several feet above Derek\\u2019s head. One set of armor is at floor level. At the end of the room is a large wooden door. There is a sconce set into the door with a small candle that is burning.\", \"shortDesc\": \"There are hundreds of armor displays, one is at floor level. At the end of the room is a large wooden door with a sconce set into it.\", \"priorVisit\": false}, {\"name\": \"Underground Grotto\", \"longDesc\": \"Inside the chamber, Derek looks around and  sees a beautiful purple crystal laying on the ground. It sparkles and has a strange glow around it. Shining his flashlight, letters appear inside the crystal. To his left, he finds a large body of water. The water is very clear and not too deep. Concentric rings of ripples from water dripping from stalactites decorate the water.  There is a small canoe tied to a stalagmite.\", \"shortDesc\": \"There is a purple crystal laying on the ground. To the left, there is a large body of water. A small canoe is tied up.\", \"priorVisit\": false}, {\"name\": \"Library of Magical Tomes\", \"longDesc\": \"The library is large with many bookshelves filled with old books.  There are several tables and chairs scattered throughout. In the center of the room there is a table with a lamp, an open book rests there under the light. Behind the table on the far wall, a large window set several feet from the floor streams sunlight.\", \"shortDesc\": \"A library filled with books. There are several tables and chairs scattered throughout. On the far wall is a large window.\", \"priorVisit\": false}, {\"name\": \"The Golden Beach\", \"longDesc\": \"Fine grain sand, the color of gold dust fills the beach at the head of the river.  Vine covered statues are placed in a semi-circle around a central statue of a figure that has it\\u2019s arm outstretched as if it is pointing towards something, it is covered in vines from head-to-toe.  Beyond the clearing is a trail and a marker.\", \"shortDesc\": \"A beach with golden sand sits at the head of the river. Vine covered statues are visible. Beyond the clearing is a trail.\", \"priorVisit\": false}, {\"name\": \"Janitor's Closet\", \"longDesc\": \"Derek looks around but it is too dark to see. He takes out his cellphone and uses the light to look around. As he does so, he sees a rusty skeleton key laying on the floor. On a small table, there is a well worn hammer. To his left, he sees a narrow stairway hewn out of rock that leads down. There are old wooden boards crossing the entrance to the stairway, blocking it. To the right of the stairs an anteroom. There is a picture hanging on the far wall of the anteroom.\", \"shortDesc\": \"There is a rusty skeleton key on the floor. On a small table, there is a hammer. To the left is a stairway with wooden boards. To the right is an anteroom with a picture.\", \"priorVisit\": false}]"
}