{
      "intro": "\nA teenage boy takes a brief look out of his window to observe his hometown on the clear and quiet night.  While not as bustling as some nearby cities, the modest town is both active and peaceful. Small enough where everyone knows each other, yet large enough to feel alive. Not much of significance goes on around the area - no drama, no craziness… nothing. Nothing happens around here, but the Boy has grown up here and come to love his home.  \n\nHe steps back from the window and crawls under his covers. In a few days, he’ll be having the time of his life at his senior prom. The Boy doesn’t have a date, but he doesn’t care - he has plenty of friends he’ll be going with to the dance all high school kids look forward to. \n\nThe Boy is excited - but deep down, he also dreads the day’s arrival.  After all the fun of the night ends, he’ll be one step closer to graduation, and one step closer to growing up.  Inside, the Boy is nervous about growing up. In a few months time, he’ll be moving away from the home he has lived so comfortably in for his entire life, away from his friends and parents, to attend university in a far away state.  \n\nThe Boy sinks his head face first into the pillow, wishing he had taken his studies a little more seriously in order to attend a closer and more prestigious school about 40 minutes away, where many of his classmates will be attending in the fall. Instead, he will be attending a school that is, while still fairly strong academically, a few hours away by plane.  Not knowing what he wants to do with his life and battling nerves about a change of scenery, Boy often finds himself wishing things could be different, that he could have done better when he still had the chance.\n\nEach night, as adulthood inches closer, he struggles to cope with his anxiety, replaying his memories of recent years and thinking about hypothetical what-ifs.  The Boy knows his home isn’t going anywhere - but he is.  Tonight, like each night, he rolls around in bed, lost in his imagination and fear, before his eyes grow weary and he, finally, drifts off to sleep.\n",
      "ending": "\nThe shining pendant the Boy has begins glowing. As he pulls it out and observes the light, he looks up and realizes something strange is happening. Daylight is suddenly shifting into a night sky, and taking the place of the sun is a full moon. Just like the moon back home, it is fills the land with light. The Boy notices that the moonlight seems to be particularly shining on the Lake Lunaria itself.\n\nAll around him, he is surrounded by a glow. Glowing moonlight, a glowing pendant, the glistening water of the lake.  It seems the old pendant with the gemstone slotted inside of it is reacting to the scene. Gradually, the Boy comes to suspect that the owner of the old home in Astraia was searching for this exact moment. As he reflects further, he thinks about the adventure he has had - waking up in a forest, experiencing the sight of a rapid waterfall, a different town full of different people, mountains, caves... all for the first time in his short life. He felt nervous, anxious, but above all - curious. Curiosity to the point that he often forgot his situation, and that he was away from home.\n\nThinking about this, he walks out on the dock, as if forgetting all about what was happening in front of his eyes. Instead of fear, he felt relief. The Boy had been caught up in his own worries about leaving home and growing up, but before he knew it, he had come to embrace this strange world for all of its discoveries and experiences it had to offer. As the moonlight becomes more blinding, it envelops the Boy, who instinctively closes his eyes.\nHe feels the familiar touch of his covers, and recognizes the familiar scent of his home. Turning over, lost in the comfort of familiarity and optimism towards his unknown future, the weary Boy begins to drift off to sleep, peacefully, for the first time in a long time."
}